{
  "movies": [
    {
      "title": "The Witcher",
      "type": "Series",
      "genres": [
        "Action",
        "Cipher",
        "Thriller"
      ],
      "rating": "7.4",
      "year": "2020",
      "url": "https://occ.a.nflxso.net/dnm/api/v6/E8vDc_W8CLv7-yMQu8KMEC7Rrr8/AAAABUSK1CQllEySF2OPLqfy9QkZYhOtHyDou_FI4K9qoGoQhKJ5ceVUkUOssDF0iHBnBKge--zAV77y4pDxpn5j3tWoutkyDDXAqVQM.jpg?r=02f",
      "plot": "The Witcher is a series of video games developed and published by CD Projekt RED and later converted into a film series by Polish studio Obsidian Entertainment. The series is based on the graphic novel The Witcher: Wild Hunt, and was released in multiple regions worldwide on October 24, 2017, and concluded with the film The Witcher: The Game of the Year 2017 on January 31, 2018.",
      "id": "9rx-Rgg"
    },
    {
      "title": "The Avengers",
      "type": "Movie",
      "genres": [
        "Comics",
        "Cipher",
        "Thriller"
      ],
      "rating": "7.4",
      "year": "2012",
      "url": "https://cdn.britannica.com/60/182360-050-CD8878D6/Avengers-Age-of-Ultron-Joss-Whedon.jpg",
      "plot": "When Thor's evil brother, Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D., initiates a superhero recruitment effort to defeat the unprecedented threat to Earth. Joining Fury's dream team are Iron Man (Robert Downey Jr.), Captain America (Chris Evans), the Hulk (Mark Ruffalo), Thor (Chris Hemsworth), the Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner).",
      "id": "7rx-Ryg"
    },
    {
      "title": "Spiderman 3",
      "type": "Movie",
      "genres": [
        "Action",
        "Adventure",
        "Thriller"
      ],
      "rating": "9.0",
      "year": "2021",
      "url": "https://www.sonypictures.com/sites/default/files/styles/max_560x840/public/chameleon/title-movie/230057_Spider-Man3_2007_1400x2100_US_1.jpg?itok=axS0bxW1",
      "plot": "Peter Parker (Tobey Maguire) and M.J. (Kirsten Dunst) seem to finally be on the right track in their complicated relationship, but trouble looms for the superhero and his lover. Peter's Spider-Man suit turns black and takes control of him, not only giving Peter enhanced power but also bringing out the dark side of his personality. Peter must overcome the suit's influence as two supervillains, Sandman and Venom, rise up to destroy him and all those he holds dear.",
      "id": "XHVvxB5"
    },
    {
      "title": "Mr Bean's Holiday",
      "type": "Movie",
      "genres": [
        "Comedy",
        "Adventure",
        "Road"
      ],
      "rating": "7.2",
      "year": "2007",
      "url": "https://raisingchildren.net.au/__data/assets/image/0015/51261/mr-beans-holiday.jpg",
      "plot": "Mr Bean is going on holiday to the south of France, looking for a quiet and sunny trip on the Riviera. However, his trip doesn't go as smoothly as expected when he has to face a series of misunderstandings and unfortunate coincidences. Eventually, Mr. Bean will end up spoiling the last film of the snobbish director Carson Clay and appearing by accident at the Cannes Film Festival.",
      "id": "pwfFRV0"
    },
    {
      "title": "The Prodigy",
      "type": "Movie",
      "genres": [
        "Horror",
        "Thriller"
      ],
      "rating": "7.0",
      "year": "2021",
      "url": "https://material.asset.catchplay.com/C21-IN-001-A1052/artworks/posters/C21-IN-001-A1052-P1200.jpg?hash=1656562542",
      "plot": "Sarah and John Blume are thrilled when their young son Miles starts to show signs of rapid development and extreme intelligence. Their family bliss soon turns into a living nightmare when Miles' behavior becomes increasingly erratic and violent by his eighth birthday. After seeking help from two experts, Sarah is horrified to learn that her beloved prodigy may be under the grip of a dark and supernatural force.",
      "id": "Z_6nxN9"
    },
    {
      "title": "Fast and Furious 8",
      "type": "Movie",
      "genres": [
        "Action",
        "Crime",
        "Adventure",
        "Thriller"
      ],
      "rating": "8.5",
      "year": "2017",
      "url": "https://i.ytimg.com/vi/H0tiy4konIg/maxresdefault.jpg",
      "plot": "With Dom and Letty married, Brian and Mia retired and the rest of the crew exonerated, the globe-trotting team has found some semblance of a normal life. They soon face an unexpected challenge when a mysterious woman named Cipher forces Dom to betray them all. Now, they must unite to bring home the man who made them a family and stop Cipher from unleashing chaos.\n",
      "id": "5Dp9ZYo"
    },
    {
      "title": "Money Heist 3",
      "type": "Series",
      "genres": [
        "Heist",
        "Drama",
        "Thriller",
        "Crime"
      ],
      "rating": "9.0",
      "year": "2020",
      "url": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/12/6/w1200X800/MH5-.jpg",
      "plot": "A criminal mastermind who goes by The Professor has a plan to pull off the biggest heist in recorded history -- to print billions of euros in the Royal Mint of Spain. To help him carry out the ambitious plan, he recruits eight people with certain abilities and who have nothing to lose. The group of thieves takes hostages to aid in their negotiations with the authorities, who strategize to come up with a way to capture The Professor. As more time elapses, the robbers prepare for a showdown with the police.",
      "id": "M0bboKh"
    }
  ]
}
